test/liquid_solid_fluidized_bed_semi/force_buoyancy+drag+vm/Dallavalle/CFD/constant/LESProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      LESProperties;
}

LESModel        oneEqEddy;

delta           cubeRootVol;

printCoeffs     on;

cubeRootVolCoeffs
{
  deltaCoeff      1;
}

PrandtlCoeffs
{
  delta           cubeRootVol;
  cubeRootVolCoeffs
  {
      deltaCoeff      1;
  }

  smoothCoeffs
  {
      delta           cubeRootVol;
      cubeRootVolCoeffs
      {
          deltaCoeff      1;
      }

      maxDeltaRatio   1.1;
  }

  Cdelta          0.158;
}

vanDriestCoeffs
{
  delta           cubeRootVol;
  cubeRootVolCoeffs
  {
      deltaCoeff      1;
  }

  smoothCoeffs
  {
      delta           cubeRootVol;
      cubeRootVolCoeffs
      {
          deltaCoeff      1;
      }

      maxDeltaRatio   1.1;
  }

  Aplus           26;
  Cdelta          0.158;
}

smoothCoeffs
{
  delta           cubeRootVol;
  cubeRootVolCoeffs
  {
      deltaCoeff      1;
  }

  maxDeltaRatio   1.1;
}
